#!/bin/bash
#Проверка введённого ip адреса.
read -p "Введите ip из подсети 172.19.0.0/21_(255.255.248.0) за исключением subnet и broadcast: " ip
if \
   [[ $ip =~ ^172\.19\.[0-7]\.[0-9]{1,3}$ ]]  && \
   [[ ! $ip =~ ^172\.19\.[0-7]\.0.*$ ]] && #\    #Исключим subnet ip add 172.19.0.0,172.19.0.000,172.19.0.0abc
   [[ ! $ip =~ ^172\.19\.7\.255$ ]]              #Исключим broadcast (172.19.7.255).
  then echo ""$ip"-- из подсети 172.19.0.0/21. "
  else echo ""$ip"-- НЕ из подсети 172.19.0.0/21. "
fi
exit 0
